app/views/questions/_list_answers_and_responses.html.erb

<div>
  <% @question.answers.each do |ans| %>
---
SELECT "answers".* FROM "answers"  WHERE "answers"."question_id" = ?  [["question_id", 4]]