app/views/tags/_show_tag.html.erb

SELECT "questions".* FROM "questions" INNER JOIN "question_tags" ON "questions"."id" = "question_tags"."question_id" WHERE "question_tags"."tag_id" = ?  [["tag_id", 1]]
---
 <ul class="list-group">
   <% @tag.questions.each do |question| %>