app/views/tags/show.html.erb


<% @tag.questions.each do |question| %>
---
SELECT "questions".* FROM "questions" INNER JOIN "question_tags" ON "questions"."id" = "question_tags"."question_id" WHERE "question_tags"."tag_id" = ?  [["tag_id", 1]]