app/controllers/questions_controller.rb

  def index
    @questions = Question.all
---
SELECT "questions".* FROM "questions"   ORDER BY likes.size DESC

  def create
    @question = Question.new(question_params)
    if @question.save
      # @question.tags.find_or_create_by(name: tag)
      params[:tags].split(", ").each { |tag| QuestionTag.create(question_id: @question.id, tag_id: Tag.find_or_create_by(name: tag).id)}
---
INSERT INTO "questions" ("body", "title") VALUES (?, ?)  [["body", "I've been looking for Carmen for the past 5 days. I think she's cheating on me :-( . Please help. Have you seen her????"], ["title", "Where in the world is carmen Sandiego?"]]
INSERT INTO "question_tags" ("question_id", "tag_id") VALUES (?, ?)  [["question_id", 7], ["tag_id", 8]]
INSERT INTO "tags" ("name") VALUES (?)  [["name", "CARMEN"]]
SELECT  "tags".* FROM "tags"  WHERE "tags"."name" = 'CARMEN' LIMIT 1

  def upvote
    @question = Question.find(params[:id])
---
SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = ? LIMIT 1  [["id", 1]]

  def downvote
    @question = Question.find(params[:id])
---
SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = ? LIMIT 1  [["id", 1]]